In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
pd.read_csv?

# Read CSV File from URL

In [ ]:
csv_url = "file path"
pd.read_csv(csv_url).head()

# Read CSV from a local file

# First example

In [6]:
df= pd.read_csv ("C:/Users/DELL/btc-market-price.csv")

In [7]:
df.head()

   2/4/17 0:00  1099.169125
0  3/4/17 0:00     1141.813
1  4/4/17 0:00            ?
2  5/4/17 0:00  1133.079314
3  6/4/17 0:00            -
4  7/4/17 0:00            -

In [10]:
df=pd.read_csv ("C:/Users/DELL/btc-market-price.csv",
                header=None,
                na_values=['', '?', '_', '-'])

In [11]:
df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [13]:
df=pd.read_csv ("C:/Users/DELL/btc-market-price.csv",
                header=None,
                na_values=['', '?', '_', '-'],
                names=['Timestamp', 'Price'])

In [14]:
df.head()

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    object
 1   Price      354 non-null    float64
dtypes: float64(1), object(1)
memory usage: 5.8+ KB

In [16]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [20]:
df['Timestamp']=pd.to_datetime(df['Timestamp']).head()

In [21]:
df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [22]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [23]:
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                 na_values=['', '?', '-'],
                 names=['Timestamp', 'Price'],
                 dtype={'Price': 'float'},
                 parse_dates=[0])

In [24]:
df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    datetime64[ns]
 1   Price      354 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 5.8 KB

In [26]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [27]:
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                 na_values=['', '?', '-'],
                 names=['Timestamp', 'Price'],
                 dtype={'Price': 'float'},
                 parse_dates=[0],
                 index_col=[0])

In [28]:
df.head()

                  Price
Timestamp
2017-02-04  1099.169125
2017-03-04  1141.813000
2017-04-04          NaN
2017-05-04  1133.079314
2017-06-04          NaN

In [29]:
df.dtypes

Price    float64
dtype: object

# Second Example

In [30]:
exam=pd.read_csv("C:/Users/DELL/exam_review.csv")

In [32]:
exam.head()

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

In [35]:
exam=pd.read_csv("C:/Users/DELL/exam_review.csv",
                sep='>')

In [36]:
exam

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [37]:
exam=pd.read_csv("C:/Users/DELL/exam_review.csv",
                sep='>',
                 decimal=',',
                 skiprows=[1,3])

In [38]:
exam

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

In [40]:
exam=pd.read_csv("C:/Users/DELL/exam_review.csv",
                sep='>',
                 decimal=',',
                 skip_blank_lines=False)

In [41]:
exam

  first_name last_name   age  math_score  french_score
0        Ray    Morley  18.0        68.0          75.0
1     Melvin     Scott  24.0        77.0          83.0
2     Amirah     Haley  22.0        92.0          67.0
3        NaN       NaN   NaN         NaN           NaN
4     Gerard     Mills  19.0        78.0          72.0
5        Amy    Grimes  23.0        91.0          81.0

# Using a Series instead of DataFrame

In [42]:
exam_test_1 = pd.read_csv('exam_review.csv',
                          sep='>',
                          usecols=['last_name'])

In [43]:
exam_test_1

  last_name
0    Morley
1     Scott
2     Haley
3     Mills
4    Grimes

In [44]:
type(exam_test_1)

pandas.core.frame.DataFrame

In [45]:
exam_test_2 = pd.read_csv('exam_review.csv',
                          sep='>',
                          usecols=['last_name'],
                          squeeze=True)

In [46]:
exam_test_2

0    Morley
1     Scott
2     Haley
3     Mills
4    Grimes
Name: last_name, dtype: object

# Save to CSV file

In [47]:
exam

  first_name last_name   age  math_score  french_score
0        Ray    Morley  18.0        68.0          75.0
1     Melvin     Scott  24.0        77.0          83.0
2     Amirah     Haley  22.0        92.0          67.0
3        NaN       NaN   NaN         NaN           NaN
4     Gerard     Mills  19.0        78.0          72.0
5        Amy    Grimes  23.0        91.0          81.0

In [48]:
exam.to_csv()

',first_name,last_name,age,math_score,french_score\r\n0,Ray,Morley,18.0,68.0,75.0\r\n1,Melvin,Scott,24.0,77.0,83.0\r\n2,Amirah,Haley,22.0,92.0,67.0\r\n3,,,,,\r\n4,Gerard,Mills,19.0,78.0,72.0\r\n5,Amy,Grimes,23.0,91.0,81.0\r\n'

In [49]:
exam.to_csv('out.csv')

In [50]:
pd.read_csv('out.csv')

   Unnamed: 0 first_name last_name   age  math_score  french_score
0           0        Ray    Morley  18.0        68.0          75.0
1           1     Melvin     Scott  24.0        77.0          83.0
2           2     Amirah     Haley  22.0        92.0          67.0
3           3        NaN       NaN   NaN         NaN           NaN
4           4     Gerard     Mills  19.0        78.0          72.0
5           5        Amy    Grimes  23.0        91.0          81.0

In [52]:
exam.to_csv('out.csv',
            index=None)

In [53]:
pd.read_csv('out.csv')

  first_name last_name   age  math_score  french_score
0        Ray    Morley  18.0        68.0          75.0
1     Melvin     Scott  24.0        77.0          83.0
2     Amirah     Haley  22.0        92.0          67.0
3        NaN       NaN   NaN         NaN           NaN
4     Gerard     Mills  19.0        78.0          72.0
5        Amy    Grimes  23.0        91.0          81.0